Data Type
    int     เก็บข้อมูลชนิดจำนวนเต็ม  %d
    float	เก็บข้อมูลชนิดทศนิยม โดยเก็บค่าทศนิยมประมาณ 6 ตัว  %f
    double	เก็บข้อมูลชนิดทศนิยม โดยเก็บค่าทศนิยมประมาณ 12 ตัว  %lf
    char	เก็บข้อมูลชนิดตัวอักขระ  %c

%c  ใช้กับตัวแปรที่เก็บค่าที่เป็น char
%s  ใช้กับตัวแปรที่เก็บค่าที่เป็นข้อความที่เก็บในตัวแปรชุด
%d  ใช้กับตัวแปรที่เก็บค่าที่เป็น int
%u  ใช้กับตัวแปรที่เก็บค่าที่เป็น *เลขจำนวนเต็มบวก*
%f  ใช้กับตัวแปรที่เก็บค่าที่เป็น float
%e  ใช้กับตัวแปรที่เก็บค่าที่เป็น *เลขทศนิยมในรูป  e ยกกำลัง*
%x  ใช้กับตัวแปรที่เก็บค่าที่เป็น *เลขฐาน 10*
%o  ใช้กับตัวแปรที่เก็บค่าที่เป็น *เลขฐาน 8*
%p  ใช้กับตัวแปรที่เก็บค่าที่เป็น *ตัวชี้ตำแหน่ง (Pointer)*
%lf ใช้กับตัวแปรที่เก็บค่าที่เป็น double
%ld ใช้กับตัวแปรที่เก็บค่าจำพวก long, long long long, unsigned int, unsigned long long long  

Operators
    +	การบวก
    -	การลบ
    *	การคูณ
    /	การหาร
    %	การหารเอาเศษ
    ++	การเพิ่มขึ้น 1
    --	การลดลง 1

    ==	เท่ากับ	
    !=	ไม่เท่ากับ
    >	มากกว่า	
    <	น้อยกว่า
    >=	มากกว่าเท่ากับ
    <=	น้อยกว่าเท่ากับ

printf() ใช้สำหรับแสดงผลข้อมูล
scanf() ใช้สำหรับรับค่าข้อมูลจากผู้ใช้
fgets() ใช้สำหรับการอ่านข้อความเป็นบรรทัดจากไฟล์

If statement
    ใช้คำสั่ง if เพื่อระบุบล็อกของโค้ดที่จะดำเนินการหากเงื่อนไขเป็นจริง

Switch
    แทนที่จะเขียนคำสั่ง if..else จำนวนมาก คุณสามารถใช้คำสั่ง switch ได้
    คำสั่ง switch จะเลือกหนึ่งในบล็อกโค้ดจำนวนมากที่จะดำเนินการ

While Loop
    ลูปสามารถเรียกใช้บล็อกของโค้ดได้ตราบเท่าที่ถึงเงื่อนไขที่ระบุ
    การวนซ้ำมีประโยชน์เพราะช่วยประหยัดเวลา ลดข้อผิดพลาด และทำให้อ่านโค้ดได้ง่ายขึ้น

For Loop
    เมื่อคุณทราบแน่ชัดว่าคุณต้องการวนซ้ำบล็อกโค้ดกี่ครั้ง ให้ใช้ for วนซ้ำแทนการวนซ้ำ while

คำสั่ง break สามารถใช้เพื่อกระโดดออกจากลูป
คำสั่ง Continue คือคำสั่งที่กลับไปตรวจสอบเงื่อนไขของลูป ถ้าเงื่อนไขเป็นจริงก็ดำเนินการทำคำสั่งในลูปต่อไป

Arrays
    อาร์เรย์ใช้เพื่อเก็บค่าหลายค่าไว้ในตัวแปรเดียว แทนที่จะประกาศตัวแปรแยกกันสำหรับแต่ละค่า
    หากต้องการสร้างอาร์เรย์ ให้กำหนดประเภทข้อมูล (เช่น int) และระบุชื่ออาร์เรย์ตามด้วยวงเล็บเหลี่ยม []
    เช่น int myNumbers[] = {25, 50, 75, 100};

Pointer
    คือตัวแปรที่เก็บที่อยู่หน่วยความจำของตัวแปรอื่นเป็นค่าของมัน
    ตัวแปรพอยน์เตอร์ชี้ไปที่ชนิดข้อมูล (เช่น int) ที่เป็นประเภทเดียวกัน และสร้างขึ้นด้วยตัวดำเนินการ *
    ที่อยู่ของตัวแปรที่คุณกำลังทำงานถูกกำหนดให้กับตัวชี้

    ตัวอย่าง :
    int myAge = 43;     // An int variable
    int* ptr = &myAge;  // A pointer variable, with the name ptr, that stores the address of myAge

    // Output the value of myAge (43)
    printf("%d\n", myAge);

    // Output the memory address of myAge (0x7ffe5367e044)
    printf("%p\n", &myAge);

    // Output the memory address of myAge with the pointer (0x7ffe5367e044)
    printf("%p\n", ptr);
